package org.desktop.model;

public enum TypeCode {
    Я, //полный рабочий день
    Н, //отсутствие на рабочее место по невыясненным причинам;
    В,  //выходные и праздничные дни;
    Рв, //работа в праздничные и выходные дни; а также работа в праздничные и выходные дни, при нахождении в командировке;
    Б, //дни временной нетрудоспособности;
    К, //командировочные дни; а также, выходные (нерабочие) дни при нахождении в командировке, когда сотрудник отдыхает, в соответствии с графиком работы ООО «Наука» в командировке;
    ОТ, //ежегодный основной оплаченный отпуск;
    До, //неоплачиваемый отпуск (отпуск за свой счет);
    Хд, //хозяйственный день;
    У, //отпуск на период обучения.
    Ож //Отпуск по уходу за ребенком.

}
